#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//int  Add(int x, int y)//Add函数名，（）参数，{}函数体
//{
//	int z = x + y;
//	return z;
//}
//int main()
//{
//	int num1 = 10;
//	int num2 = 20;
//	int sum = 0;
//	sum = Add(num1, num2);
//	printf("sum = %d\n", sum);
//	return 0;
//}

//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//定义一个存放10个整数数字的数组,下标为0~9
//	int i = 0;
//	while (i < 10)
//	{
//		printf("%d ", arr[i]);
//		i++;
//	}
//	return 0;
//}
//&   按位与      |    按位或      ^      按位异或
//5/2取商=2，5%2取模-余数=1
//&按位与=并起来。例子：
//0为假，非0为真，假并真为假，按位与同时真为真//011&101=001
//|按位或，一真为真：011|101=111
//^按位异或,对应的2进制位相同则为0，相异则为1
//例：011^101=110
//==判断是否相等
//a += 10-----a = a + 10
//！把假变真，真变假--逻辑反操作
//!=为不等于的意思
